snlkuharlocal/src/Documents/ПолныеДанныеЗаданияНабора/ПолныеДанныеЗаданияНабора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПолныеДанныеЗаданияНабора</name>
  <basedOn>Document.ЗаданиеНабора</basedOn>
  <attributes>
    <name>ОтгрузкаКомплектов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ЗаданиеНабора</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Накладная</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКлиентаFBS</name>
    <type>
      <types>DocumentRef.ЗаказКлиентаFBS</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаказаFBS</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихКодFBS</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоОтсканировано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПрефиксЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуффиксЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комплектующие</name>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>Количество номенклатуры</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПродукции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаказаFBS</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихКодFBS</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоНоменклатурыОтсканировано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПродукцииОтсканировано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоТовар</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПрефиксЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуффиксЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Enums/ВидыНоменклаутры/ВидыНоменклаутры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыНоменклаутры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>ОсновноеСредство</name>
  </enumValues>
  <enumValues>
    <name>МБП</name>
  </enumValues>
  <enumValues>
    <name>Материал</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>ПодарочныйСертификат</name>
  </enumValues>
  <enumValues>
    <name>КомпьютернаяТехника</name>
  </enumValues>
  <enumValues>
    <name>РекламаПлатная</name>
  </enumValues>
  <enumValues>
    <name>РекламаБесплатная</name>
  </enumValues>
  <enumValues>
    <name>Упаковка</name>
  </enumValues>
  <enumValues>
    <name>ТМЦнаОтветственномХранении</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыКомплектов/ВидыКомплектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКомплектов</name>
  <enumValues>
    <name>Комплект</name>
  </enumValues>
  <enumValues>
    <name>Ассортито</name>
  </enumValues>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>ГотовыйКомплект</name>
  </enumValues>
  <enumValues>
    <name>АссортитоКомплектов</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ЗаданиеНабора/ЗаданиеНабора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаданиеНабора</name>
  <basedOn>Document.ПланНабора</basedOn>
  <registerRecords>AccumulationRegister.РезервыТМЦ</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПланНабора</types>
    </type>
  </attributes>
  <attributes>
    <name>КодТСД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЧасти</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеНакладной</name>
    <type>
      <types>EnumRef.СостоянияНакладной</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоКомплектующие</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоБлочки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Накладная</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>String</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Перемещение</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отгружен</name>
    <type>
      <types>EnumRef.Отгружен</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданоОбработкойПополнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сектор</name>
    <type>
      <types>CatalogRef.СектораХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтправленНаТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагруженИзТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СобиратьНаТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроходнаяНакладная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СобиратьВПервуюОчередь</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УзелТСД</name>
    <type>
      <types>ExchangePlanRef.МобильныеТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследовательныйНабор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборМиксами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяМаркировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяФормированиеНабораЧЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормированиеНаборовЧЗЗавершено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗНМ</name>
    <type>
      <types>DocumentRef.ЗаданиеНаМаркировку</types>
    </type>
  </attributes>
  <attributes>
    <name>НеконтролироватьСканированиеЧЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМестоНаборщика</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресноеХранение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Разделенная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредыдущийЗНБ</name>
    <type>
      <types>DocumentRef.ЗаданиеНабора</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧастичноСобран</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДляНаборов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяМаркировка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПланируемыеСостояния</name>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>EnumRef.СостоянияНакладной</types>
      </type>
    </attributes>
    <attributes>
      <name>Пропустить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Documents/ПолныеДанныеЗаданияНабора/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)  экспорт
	если ТипЗнч(ДанныеЗаполнения)<>Тип("ДокументСсылка.ЗаданиеНабора") тогда
		СообщитьИзМодуля("Документ полные данные ЗНБ вводится только на основании ЗНБ");
		Возврат;
	КонецЕсли;
	
	
	
	ДокОснование=ДанныеЗаполнения;
	
	
	СтруктураРеквизитовЗНБ=ПолучитьРеквизитыШапки(ДокОснование,"Накладная,Получатель,Склад,Получатель.Код","Документ");
	Накладная=СтруктураРеквизитовЗНБ.Накладная;
	Контрагент=СтруктураРеквизитовЗНБ.Получатель;
	Склад=СтруктураРеквизитовЗНБ.Склад;
	// Кухарь А.Ю.  22.03.2024 начало
	//
	КодКонтрагента=СтруктураРеквизитовЗНБ.Получатель_Код;
	
	// Кухарь А.Ю.  06.08.2024 начало
	// если КодКонтрагента="SSR-9059" тогда //WB
	если КодКонтрагента="SSR-9059" или КодКонтрагента="SST-1208"  тогда //WB
		// Кухарь А.Ю.  06.08.2024 конец
		
		ПроверятьСуффикс=Истина;
	иначе
		ПроверятьСуффикс=Ложь;
	КонецЕсли;
	// Кухарь А.Ю.  22.03.2024 конец
	
	
	если ТипЗнч(Накладная) <> Тип("ДокументСсылка.РасходнаяНакладная") тогда		
		СообщитьИзМодуля("Документ полные данные ЗНБ вводится только к РНК.");
		Возврат;
	КонецЕсли;
	
	РеквизитыНакладной=ПолучитьРеквизитыШапки(Накладная,"ОтгрузкаКомплектов","Документ");
	ОтгрузкаКомплектов=РеквизитыНакладной.ОтгрузкаКомплектов;
	
	//если не ОтгрузкаКомплектов  тогда
	//	СообщитьИзМодуля("Накладная вводится только накладные с комплектацией.");
	//	Возврат;		
	//КонецЕсли;
	
	
	ЗаказКлиентаFBS=ОбщегоНазначения_ПИ.ПолучитьЗаказКлиентаFBSПоНакладной(Накладная);
	если ЗаказКлиентаFBS=Неопределено тогда
		СообщитьИзМодуля("Отсутствует документ заказ клиента FBS. Документ полные данные ЗНБ - не заполнен.");
		Возврат;
	КонецЕсли;
	
	
	
	запрос=новый запрос; //Сформируем массив номенклатуры для отбора по ТЧ КМП РНК
	запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	ЗаданиеНабораТовары.Номенклатура КАК Номенклатура
	             |ИЗ
	             |	Документ.ЗаданиеНабора.Товары КАК ЗаданиеНабораТовары
	             |ГДЕ
	             |	ЗаданиеНабораТовары.Ссылка = &Ссылка
	             |	И ЗаданиеНабораТовары.Количество > 0
	             |	И ЗаданиеНабораТовары.Номенклатура.Родитель.ВидНоменклатуры = &Товар";
	запрос.УстановитьПараметр("Ссылка",ДокОснование);
	// Кухарь А.Ю.  27.03.2023 начало
	запрос.УстановитьПараметр("Товар",Перечисления.ВидыНоменклаутры.Товар);
	// Кухарь А.Ю.  27.03.2023 конец
	
	МассивНоменклатуры=запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура");
	
	
	//Сформируем массив Продукции для отбора по заказу клиента FBS
	
	запрос.Текст="ВЫБРАТЬ различные
	|	ТЧ.Продукция КАК Продукция
	|ИЗ
	|	Документ.РасходнаяНакладная.Комплектующие КАК ТЧ
	|ГДЕ
	|	ТЧ.КоличествоПродукции > 0
	|	И ТЧ.Ссылка = &Ссылка
	|	И ТЧ.Номенклатура В(&Номенклатура)";
	если не ОтгрузкаКомплектов тогда
		запрос.Текст=СтрЗаменить(запрос.Текст,"Документ.РасходнаяНакладная.Комплектующие","Документ.РасходнаяНакладная.Товары");
		запрос.Текст=СтрЗаменить(запрос.Текст,"ТЧ.Продукция КАК Продукция","ТЧ.Номенклатура КАК Продукция");
		запрос.Текст=СтрЗаменить(запрос.Текст,"ТЧ.КоличествоПродукции > 0","ТЧ.Количество > 0");
	КонецЕсли;
	запрос.УстановитьПараметр("Ссылка",Накладная);
	запрос.УстановитьПараметр("Номенклатура",МассивНоменклатуры);
	МассивПродукции= запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Продукция");
	
	
	запрос.Текст="ВЫБРАТЬ
	|	ЗаказКлиентаFBSТовары.Номенклатура КАК Номенклатура,
	|	ЗаказКлиентаFBSТовары.Количество КАК Количество,
	|	ЗаказКлиентаFBSТовары.ШтрихКод КАК ШтрихКодFBS,
	|	ЗаказКлиентаFBSТовары.НомерЗаказа КАК НомерЗаказаFBS,
	|	ЗаказКлиентаFBSТовары.ПрефиксЗаказа КАК ПрефиксЗаказа,
	|	ЗаказКлиентаFBSТовары.СуффиксЗаказа КАК СуффиксЗаказа
	|ИЗ
	|	Документ.ЗаказКлиентаFBS.Товары КАК ЗаказКлиентаFBSТовары
	|ГДЕ
	|	ЗаказКлиентаFBSТовары.Ссылка = &Ссылка
	|	И ЗаказКлиентаFBSТовары.Номенклатура В(&Номенклатура)
	|	И НЕ ЗаказКлиентаFBSТовары.Отменен
	|	И НЕ ЗаказКлиентаFBSТовары.ВычеркОфис
	|	И НЕ ЗаказКлиентаFBSТовары.ВычеркСклад
	|	И ЗаказКлиентаFBSТовары.Количество > 0";
	запрос.УстановитьПараметр("Ссылка",ЗаказКлиентаFBS);
	запрос.УстановитьПараметр("Номенклатура",МассивПродукции);
	
	Товары.Загрузить(запрос.Выполнить().Выгрузить());
	
	// Кухарь А.Ю.  22.03.2024 начало
	//
	если ПроверятьСуффикс тогда
		МассСтрокСОшибкой=Товары.НайтиСтроки(новый Структура("СуффиксЗаказа",""));
		если МассСтрокСОшибкой.Количество()>0 тогда
			СообщитьИзМодуля("Не заполнен суффикс заказа по некоторым строкам заказов. Попробуйте чуть позже");
			Возврат;		
		КонецЕсли;
	КонецЕсли;
	// Кухарь А.Ю.  22.03.2024 конец
	
	// Кельманов А.В. - HELP-6307 - 2025.08.07 {
	//Запрос.Текст = "ВЫБРАТЬ
	//|	ПолныеДанныеЗаданияНабораТовары.Номенклатура КАК Номенклатура,
	//|	ПолныеДанныеЗаданияНабораТовары.Количество КАК Количество,
	//|	ПолныеДанныеЗаданияНабораТовары.НомерЗаказаFBS КАК НомерЗаказаFBS,
	//|	ПолныеДанныеЗаданияНабораТовары.ШтрихКодFBS КАК ШтрихКодFBS,
	//|	ПолныеДанныеЗаданияНабораТовары.ПрефиксЗаказа КАК ПрефиксЗаказа,
	//|	ПолныеДанныеЗаданияНабораТовары.СуффиксЗаказа КАК СуффиксЗаказа
	//|ПОМЕСТИТЬ ВремТЗ
	//|ИЗ
	//|	&ТЧТовары КАК ПолныеДанныеЗаданияНабораТовары
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ПолныеДанныеЗаданияНабораТовары.Номенклатура КАК Продукция,
	//|	ЕСТЬNULL(НоменклатураКоплектующие.Номенклатура, ПолныеДанныеЗаданияНабораТовары.Номенклатура) КАК Номенклатура,
	//|	СУММА(ВЫБОР
	//|			КОГДА НоменклатураКоплектующие.Количество ЕСТЬ NULL
	//|				ТОГДА ПолныеДанныеЗаданияНабораТовары.Количество
	//|			ИНАЧЕ НоменклатураКоплектующие.Количество * ПолныеДанныеЗаданияНабораТовары.Количество
	//|		КОНЕЦ) КАК Количество,
	//|	ПолныеДанныеЗаданияНабораТовары.Количество КАК КоличествоПродукции,
	//|	ПолныеДанныеЗаданияНабораТовары.НомерЗаказаFBS КАК НомерЗаказаFBS,
	//|	ПолныеДанныеЗаданияНабораТовары.ШтрихКодFBS КАК ШтрихКодFBS,
	//|	ВЫБОР
	//|		КОГДА НоменклатураКоплектующие.Номенклатура ЕСТЬ NULL
	//|				ИЛИ НоменклатураКоплектующие.Номенклатура.Родитель.ВидНоменклатуры = &Товар
	//|			ТОГДА ИСТИНА
	//|		ИНАЧЕ ЛОЖЬ
	//|	КОНЕЦ КАК ЭтоТовар,
	//|	ПолныеДанныеЗаданияНабораТовары.ПрефиксЗаказа КАК ПрефиксЗаказа,
	//|	ПолныеДанныеЗаданияНабораТовары.СуффиксЗаказа КАК СуффиксЗаказа
	//|ИЗ
	//|	ВремТЗ КАК ПолныеДанныеЗаданияНабораТовары
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.Коплектующие КАК НоменклатураКоплектующие
	//|		ПО ПолныеДанныеЗаданияНабораТовары.Номенклатура = НоменклатураКоплектующие.Ссылка
	//// Кельманов А.В. - HELP-2976 - 2025.03.04 {
	//|			И (ПолныеДанныеЗаданияНабораТовары.Номенклатура.ВидКомплекта <> ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.ГотовыйКомплект))
	//// Кельманов А.В. - HELP-2976 - 2025.03.04 }
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ПолныеДанныеЗаданияНабораТовары.Номенклатура,
	//|	ЕСТЬNULL(НоменклатураКоплектующие.Номенклатура, ПолныеДанныеЗаданияНабораТовары.Номенклатура),
	//|	ПолныеДанныеЗаданияНабораТовары.Количество,
	//|	ПолныеДанныеЗаданияНабораТовары.НомерЗаказаFBS,
	//|	ПолныеДанныеЗаданияНабораТовары.ШтрихКодFBS,
	//|	ВЫБОР
	//|		КОГДА НоменклатураКоплектующие.Номенклатура ЕСТЬ NULL
	//|				ИЛИ НоменклатураКоплектующие.Номенклатура.Родитель.ВидНоменклатуры = &Товар
	//|			ТОГДА ИСТИНА
	//|		ИНАЧЕ ЛОЖЬ
	//|	КОНЕЦ,
	//|	ПолныеДанныеЗаданияНабораТовары.ПрефиксЗаказа,
	//|	ПолныеДанныеЗаданияНабораТовары.СуффиксЗаказа";
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПолныеДанныеЗаданияНабораТовары.Номенклатура КАК Номенклатура,
	               |	ПолныеДанныеЗаданияНабораТовары.Количество КАК Количество,
	               |	ПолныеДанныеЗаданияНабораТовары.НомерЗаказаFBS КАК НомерЗаказаFBS,
	               |	ПолныеДанныеЗаданияНабораТовары.ШтрихКодFBS КАК ШтрихКодFBS,
	               |	ПолныеДанныеЗаданияНабораТовары.ПрефиксЗаказа КАК ПрефиксЗаказа,
	               |	ПолныеДанныеЗаданияНабораТовары.СуффиксЗаказа КАК СуффиксЗаказа
	               |ПОМЕСТИТЬ ВремТЗ
	               |ИЗ
	               |	&ТЧТовары КАК ПолныеДанныеЗаданияНабораТовары
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасходнаяНакладнаяКомплектующие.Продукция КАК Продукция,
	               |	СУММА(РасходнаяНакладнаяКомплектующие.КоличествоПродукции) КАК КоличествоПродукции
	               |ПОМЕСТИТЬ ВТ_КоличествоПродукции
	               |ИЗ
	               |	Документ.РасходнаяНакладная.Комплектующие КАК РасходнаяНакладнаяКомплектующие
	               |ГДЕ
	               |	РасходнаяНакладнаяКомплектующие.Ссылка = &Накладная
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РасходнаяНакладнаяКомплектующие.Продукция
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасходнаяНакладнаяКомплектующие.Продукция КАК Продукция,
	               |	РасходнаяНакладнаяКомплектующие.Номенклатура КАК Номенклатура,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ВТ_КоличествоПродукции.КоличествоПродукции, 0) = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ РасходнаяНакладнаяКомплектующие.Количество / ВТ_КоличествоПродукции.КоличествоПродукции
	               |	КОНЕЦ КАК Количество
	               |ПОМЕСТИТЬ ВТ_Комплектующие
	               |ИЗ
	               |	Документ.РасходнаяНакладная.Комплектующие КАК РасходнаяНакладнаяКомплектующие
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КоличествоПродукции КАК ВТ_КоличествоПродукции
	               |		ПО РасходнаяНакладнаяКомплектующие.Продукция = ВТ_КоличествоПродукции.Продукция
	               |ГДЕ
	               |	РасходнаяНакладнаяКомплектующие.Ссылка = &Накладная
	               |	И ВЫБОР
	               |			КОГДА ЕСТЬNULL(ВТ_КоличествоПродукции.КоличествоПродукции, 0) = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ РасходнаяНакладнаяКомплектующие.Количество / ВТ_КоличествоПродукции.КоличествоПродукции
	               |		КОНЕЦ > 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПолныеДанныеЗаданияНабораТовары.Номенклатура КАК Продукция,
	               |	ЕСТЬNULL(ВТ_Комплектующие.Номенклатура, ПолныеДанныеЗаданияНабораТовары.Номенклатура) КАК Номенклатура,
	               |	СУММА(ВЫБОР
	               |			КОГДА ВТ_Комплектующие.Количество ЕСТЬ NULL
	               |				ТОГДА ПолныеДанныеЗаданияНабораТовары.Количество
	               |			ИНАЧЕ ВТ_Комплектующие.Количество * ПолныеДанныеЗаданияНабораТовары.Количество
	               |		КОНЕЦ) КАК Количество,
	               |	ПолныеДанныеЗаданияНабораТовары.Количество КАК КоличествоПродукции,
	               |	ПолныеДанныеЗаданияНабораТовары.НомерЗаказаFBS КАК НомерЗаказаFBS,
	               |	ПолныеДанныеЗаданияНабораТовары.ШтрихКодFBS КАК ШтрихКодFBS,
	               |	ВЫБОР
	               |		КОГДА ВТ_Комплектующие.Номенклатура ЕСТЬ NULL
	               |				ИЛИ ВТ_Комплектующие.Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ЭтоТовар,
	               |	ПолныеДанныеЗаданияНабораТовары.ПрефиксЗаказа КАК ПрефиксЗаказа,
	               |	ПолныеДанныеЗаданияНабораТовары.СуффиксЗаказа КАК СуффиксЗаказа
	               |ИЗ
	               |	ВремТЗ КАК ПолныеДанныеЗаданияНабораТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Комплектующие КАК ВТ_Комплектующие
	               |		ПО ПолныеДанныеЗаданияНабораТовары.Номенклатура = ВТ_Комплектующие.Продукция
	               |			И (ПолныеДанныеЗаданияНабораТовары.Номенклатура.ВидКомплекта <> ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.ГотовыйКомплект))
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПолныеДанныеЗаданияНабораТовары.Номенклатура,
	               |	ЕСТЬNULL(ВТ_Комплектующие.Номенклатура, ПолныеДанныеЗаданияНабораТовары.Номенклатура),
	               |	ПолныеДанныеЗаданияНабораТовары.Количество,
	               |	ПолныеДанныеЗаданияНабораТовары.НомерЗаказаFBS,
	               |	ПолныеДанныеЗаданияНабораТовары.ШтрихКодFBS,
	               |	ВЫБОР
	               |		КОГДА ВТ_Комплектующие.Номенклатура ЕСТЬ NULL
	               |				ИЛИ ВТ_Комплектующие.Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ,
	               |	ПолныеДанныеЗаданияНабораТовары.ПрефиксЗаказа,
	               |	ПолныеДанныеЗаданияНабораТовары.СуффиксЗаказа";
					
	Запрос.УстановитьПараметр("Накладная", Накладная);
	// Кельманов А.В. - HELP-6307 - 2025.08.07 }
					
	Запрос.УстановитьПараметр("Товар", Перечисления.ВидыНоменклаутры.Товар);
	Запрос.УстановитьПараметр("ТЧТовары", Товары);
	
	Комплектующие.Загрузить(Запрос.Выполнить().Выгрузить());
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДокОснование, "Накладная,Склад");
	Контрагент = Контрагент;
	
	ОбновитьШКИзМатрицы();
	
	Дата = ТекущаяДата();
	ЭтотОбъект.Проведен = Истина;
	ЭтотОбъект.Записать();
	
КонецПроцедуры


Процедура ПеречитатьДанныеЗаказаFBS () экспорт
	запрос=новый запрос;
	запрос.Текст= "ВЫБРАТЬ
	|	ЗаказКлиентаFBSТовары.Номенклатура КАК Номенклатура,
	|	ЗаказКлиентаFBSТовары.Количество КАК Количество,
	|	ЗаказКлиентаFBSТовары.ШтрихКод КАК ШтрихКодFBS,
	|	ЗаказКлиентаFBSТовары.НомерЗаказа КАК НомерЗаказаFBS,
	|	ЗаказКлиентаFBSТовары.Отменен КАК Отменен,
	|	ЗаказКлиентаFBSТовары.ПрефиксЗаказа КАК ПрефиксЗаказа,
	|	ЗаказКлиентаFBSТовары.СуффиксЗаказа КАК СуффиксЗаказа
	|ИЗ
	|	Документ.ЗаказКлиентаFBS.Товары КАК ЗаказКлиентаFBSТовары
	|ГДЕ
	|	ЗаказКлиентаFBSТовары.Ссылка = &Ссылка
	|	И ЗаказКлиентаFBSТовары.Номенклатура В(&Номенклатура)";
	запрос.УстановитьПараметр("Номенклатура",товары.ВыгрузитьКолонку("Номенклатура"));
	запрос.УстановитьПараметр("Ссылка",ЗаказКлиентаFBS);
	ТЗДанныеFBS = запрос.Выполнить().Выгрузить();
	Для каждого СтрТЧ из Товары цикл
		если СтрТЧ.НомерЗаказаFBS="" тогда
			СообщитьИзМодуля("В строке "+СтрТЧ.НомерСтроки+" пустой номер заказа");
			Продолжить;
		КонецЕсли;
		
		МассДанныхFBS=ТЗДанныеFBS.НайтиСтроки(новый Структура("НомерЗаказаFBS,Номенклатура",СтрТЧ.НомерЗаказаFBS,СтрТЧ.Номенклатура));
		если МассДанныхFBS.Количество()<>1 тогда
			СообщитьИзМодуля("Сбой расчёта по заказу №"+СтрТЧ.НомерЗаказаFBS+" номенклатуре "+СтрТЧ.Номенклатура);
			Продолжить;
		КонецЕсли;
		
		
		СтрДанныхFBS=МассДанныхFBS.Получить(0);
		ЗаполнитьЗначенияСвойств(СтрТЧ,СтрДанныхFBS,"ПрефиксЗаказа,СуффиксЗаказа,ШтрихКодFBS");
		
		если СтрДанныхFBS.Отменен<> Истина тогда
			СтрДанныхFBS.Количество=0;
		КонецЕсли;
		
		если СтрДанныхFBS.Количество<>СтрТЧ.Количество тогда
			СтрТЧ.Количество=СтрДанныхFBS.Количество;
		КонецЕсли;
		
		МассСтрокКМП=Комплектующие.НайтиСтроки(новый Структура("Продукция,НомерЗаказаFBS",СтрТЧ.Номенклатура,СтрТЧ.НомерЗаказаFBS));
		Кратность=ПолучитьРеквизитШапки(СтрТЧ.Номенклатура,"Родитель.ШтукВКомплекте","Справочник");
		если Кратность=0 тогда Кратность=1 КонецЕсли;
		
		для каждого СтрКМП из Комплектующие цикл		
			СтрКМП.КоличествоПродукции=СтрТЧ.Количество;
			СтрКМП.Количество=СтрТЧ.Количество*Кратность;     
		КонецЦикла;					
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьШКИзМатрицы () экспорт
	
	// Кельманов А.В. - HELP-3209 - 2025.03.06 {
	//ТаблицаДанныхМатрицы = ЗаполнитьТаблицуДанныхМатрицы();
	СтруктураДанных = Новый Структура("Номенклатура, ПунктДоставки, Договор, Дата, Контрагент, ПостояннаяАкция");
	
	ЗаполнитьЗначенияСвойств(СтруктураДанных, Накладная);
		
	МассивНоменклатуры = Товары.ВыгрузитьКолонку("Номенклатура");
	
	СтруктураДанных.Номенклатура = МассивНоменклатуры;
	
	ТаблицаДанныхМатрицы = ПолучитьТаблицуМатрицСрезПоследних(СтруктураДанных);
	// Кельманов А.В. - HELP-3209 - 2025.03.06 }
	
	Для Каждого СтрТЧ Из Товары Цикл
		
		СтрМатрицы = ТаблицаДанныхМатрицы.Найти(СтрТЧ.Номенклатура, "Номенклатура");
		
		Если СтрМатрицы <> Неопределено Тогда
			
			// Кельманов А.В. - HELP-3209 - 2025.03.06 {
			//СтрТЧ.ШтрихКод = СтрМатрицы.ШтрихКод;
			СтрТЧ.ШтрихКод = СтрМатрицы.ШККонтрагента;
			// Кельманов А.В. - HELP-3209 - 2025.03.06 }
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры



Функция ЗаполнитьТаблицуДанныхМатрицы () экспорт 
	
	РеквизитыШапки=ПолучитьРеквизитыШапки(Накладная,"ПунктДоставки,Договор,ПостояннаяАкция,Дата","Документ");
	Запрос			= Новый Запрос;				
	Запрос.Текст 	= "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МатрицаТовары.Номенклатура КАК Номенклатура,
	
	|	МатрицаТовары.Номенклатура.Цвет.Наименование КАК Цвет,
	|	МатрицаТовары.Номенклатура.Родитель КАК Модель,
	|	МатрицаТовары.Номенклатура.КодПроизводителя КАК КодПроизводителя,					  
	|	""Размер:"" + МатрицаТовары.Номенклатура.Размер.Наименование КАК Размер,
	|	ВЫРАЗИТЬ(МатрицаТовары.Номенклатура.Цвет.РусскоеНаименование КАК СТРОКА(30)) КАК РусскоеНаименованиеЦвета,
	|	МатрицаТовары.Номенклатура.Наименование КАК НаименованиеНоменклатуры,	
	|	МатрицаТовары.ШККонтрагента КАК ШтрихКод
	|ИЗ
	|	Документ.Матрица.Товары КАК МатрицаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
	|		ПО МатрицаТовары.Ссылка = МатрицаПунктыДоставки.Ссылка
	|ГДЕ
	|	МатрицаТовары.Ссылка.Проведен
	|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
	|	И МатрицаТовары.Ссылка.Договор = &Договор
	|	И МатрицаТовары.Ссылка.Дата <= &Дата1
	|	И МатрицаТовары.Ссылка.ДатаОкончания >= &Дата2
	|	И МатрицаПунктыДоставки.ПунктДоставки = &ПунктДоставки
	|	И МатрицаТовары.Номенклатура В(&Номенклатура)
	|	И МатрицаТовары.Ссылка.ПостояннаяАкция = &ПостояннаяАкция";
	
	Запрос.УстановитьПараметр("Дата2",			РеквизитыШапки.Дата);
	Запрос.УстановитьПараметр("Дата1",			РеквизитыШапки.Дата);
	Запрос.УстановитьПараметр("Контрагент",		Контрагент);		
	Запрос.УстановитьПараметр("ПунктДоставки",	РеквизитыШапки.ПунктДоставки);			
	Запрос.УстановитьПараметр("Договор",		РеквизитыШапки.Договор);		
	запрос.УстановитьПараметр("Номенклатура",	товары.ВыгрузитьКолонку("Номенклатура"));
	запрос.УстановитьПараметр("ПостояннаяАкция",РеквизитыШапки.ПостояннаяАкция);
	
	ТаблицаДанныхМатрицы = Запрос.Выполнить().Выгрузить();
	
	возврат ТаблицаДанныхМатрицы;
	
КонецФункции

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	// Кельманов А.В. - Закончились номера - 2025.04.15 {
	//Префикс = "OD8-";
	     
	// Кухарь А.Ю.  16.08.2025 начало
	// Префикс = "OD9-";   
	// Ихсанов Д. А. Начало 02.04.2026 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2315
	//Префикс = "OE1-";   
	Префикс = "OE2-";
	// Ихсанов Д. А. Конец  02.04.2026
	// Кухарь А.Ю.  16.08.2025 конец
	
	// Кельманов А.В. - Закончились номера - 2025.04.15 }
КонецПроцедуры
